rails/app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" INNER JOIN "vendors" ON "vendors"."id" = "locations"."vendor_id" WHERE "locations"."location_type" = $1 ORDER BY vendors.name  [["location_type", 0]]
---
  def restaurants
    @locations = Location.joins(:vendor)
                         .where(location_type: 0)
                         .order('vendors.name')

SELECT "locations".* FROM "locations" INNER JOIN "vendors" ON "vendors"."id" = "locations"."vendor_id" WHERE "locations"."state" = $1 AND "locations"."location_type" = $2 ORDER BY vendors.name  [["state", "SC"], ["location_type", 0]]
---
  def by_state
    redirect_to restaurants_url unless params[:state].present?
    redirect_to restaurants_url unless state_is_valid(params[:state])
    @locations = Location.joins(:vendor)
                         .where(state: params[:state], location_type: 0)
                         .order('vendors.name')