rails/app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all.order(:name)
---
SELECT "vendors".* FROM "vendors" ORDER BY "vendors"."name" ASC